using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class TerrainGeneratorNewTest  {

	// сетка
    //ставим точку, рисуем от нее рандомной длины линию по гор или верт

    //цикл
    //{
    //ищем кратчайший путь от начальной точки до той, на которой линия завершилась
    //если не дошли до рамок длины, рисуем где-нибудь на пересечении (рандомно) линию перпендикулярно рандомной длины
    //}

    //если дошли до рамок длины, то оставляем этот кратчайший путь, остальное удаляем. Это и будет схема дороги

    //если "перелёт", откатываем назад, пока не попадём в рамки длины, далее так же.


    //минус - теоретически может долго рисовать, при каждом пересечении откатывая длину на меньшую (типа нашелся более короткий путь)
        //тут либо как-то пересечения предотвращать (заёбисто), либо хз
    
}
